Repository: Jezzatator/BodyBuildr
Catalog: BodyBuildr/Utilities/Localize/*.lproj/Localizable.strings
Languages: fr

source: Abdominals
fr: Abdominaux

source: Upper Back
fr: Haut du dos

source: Core
fr: Le noyau

source: Lower Abdominals
fr: Abdominaux inférieurs

source: Neck
fr: Cou

source: Forearm
fr: Avant-bras

source: Middle Back
fr: Milieu du dos

source: Hip Abductors
fr: Abducteurs de hanche

source: Arms
fr: Bras

# forerm
source: Forearm
fr: Avant-bras

source: Lower Back
fr: Bas du dos

source: Lateral Deltoid
fr: Deltoïde latéral

source: Glutes
fr: Fessiers

source: Chest
fr: Poitrine

source: Back
fr: Dos

source: Hamstring
fr: Ischio-jambiers

source: Lats
fr: Grand dorsal

source: Rear Deltoid
fr: Deltoïde postérieur

source: Posterior Deltoid
fr: Deltoïde postérieur

source: Neck Extensors, Neck Flexors
fr: Extenseurs du cou, fléchisseurs du cou

source: Neck Side Flexors
fr: Fléchisseurs latéraux du cou

source: Hamstrings
fr: Ischio-jambiers

source: Shoulders
fr: Épaules

source: Trapezius
fr: Trapèzes

source: Shoulders, Lats
fr: Épaules, grand dorsal

# gluts
source: Glutes
fr: Fessiers

source: Calves
fr: Mollets

# should
source: Shoulders
fr: Épaules

source: Bench Press
fr: Développé couché

source: Tate Press
fr: Développé couché prise large

source: Static Neck Flexion Extension
fr: Flexion et extension du cou statique

source: Static Neck Side Flexion
fr: Inclinaison latérale du cou statique

source: Seated Shoulder Press Machine
fr: Presse épaules assis sur machine

source: Seated Military Press
fr: Presse militaire assis

source: Shoulder Shrugs
fr: Haussements d'épaules

source: Arnold Press
fr: Presse Arnold

source: Front Barbell Raises
fr: Élévations avant avec barre

source: Front Cable Raises
fr: Élévations avant avec câble

source: Cable Shoulder Shrugs
fr: Haussements d'épaules avec câble

source: Front Raises
fr: Élévations avant

source: Barbell Shoulder Press
fr: Presse épaules avec barre

source: Dumbbell Shoulder Press
fr: Presse épaules avec haltères

source: Smith Machine Upright Row
fr: Rowing vertical sur machine Smith

source: Upright Barbell Rows
fr: Rowing vertical avec barre

source: Upright Cable Row
fr: Rowing vertical avec câble

source: Dumbbell Upright Rows
fr: Rowing vertical avec haltères

source: Bent-over Lateral Cable Raises
fr: Élévations latérales penché avec câble

source: Lateral Dumbbell Raises
fr: Élévations latérales avec haltères

source: Ball Wall Circles
fr: Cercles mur de balle

# back-flys-exercise-band
source: Back Flys with Exercise Band
fr: Élévations latérales avec bande de résistance

source: Flat Bench Leg Raises
fr: Élévations de jambes à plat sur banc

source: Smith Machine Rear Deltoid Row
fr: Rowing arrière des deltoïdes sur machine Smith

source: Lying Rear Lateral Raise
fr: Élévation latérale arrière allongé

# rear-deltoid-row-dumbbell
source: Rear Deltoid Row with Dumbbell
fr: Rowing des deltoïdes arrière avec haltères

source: Seated Cable Rows
fr: Rowing assis avec câble

source: Reverse Grips Bent-over Barbell Rows
fr: Rowing avec barre en prise inversée penché en avant

source: Stationary Abdominal Draw In
fr: Rétraction abdominale statique

# rear-deltoid-row-barbell
source: Rear Deltoid Row with Barbell
fr: Rowing des deltoïdes arrière avec barre

source: T-Bar Rows
fr: Rowing T-bar

source: Barbell Shrugs
fr: Haussements d'épaules avec barre

# incline-shoulder-press-dumbbell
source: Incline Shoulder Press with Dumbbell
fr: Presse épaules incliné avec haltères

source: Bent-over Rear Deltoid Raise with Head on Bench
fr: Élévation arrière des deltoïdes penché avec tête sur banc

source: Front Dumbbell Raise
fr: Élévation avant avec haltère

source: Internal Cable Rotation
fr: Rotation interne avec câble

source: Seated Rear Lateral Cable Raise
fr: Élévation latérale arrière assis avec câble

source: Cuban Dumbbell Press
fr: Presse cubaine avec haltères

source: Lying One-arm Rear Lateral Raise
fr: Élévation latérale arrière d'un bras allongé

source: One-arm Dumbbell Shoulder Press
fr: Presse épaules d'un bras avec haltère

source: One-arm Upright Row
fr: Rowing vertical d'un bras

source: Dumbbell Raise
fr: Élévation avec haltère

source: Smith Machine Shoulder Shrugs
fr: Haussements d'épaules sur machine Smith

source: Incline Bench Press
fr: Développé couché incliné

source: Incline Bench Press with Bands
fr: Développé couché incliné avec bandes

source: Bent-arm Pullover
fr: Pull-over avec bras pliés

source: Dumbbell Bent-arm Pullover
fr: Pull-over avec haltères et bras pliés

source: Butterfly Machine
fr: Machine à papillon

source: Cable Crossover
fr: Crossover avec câble

source: Close Grip Barbell Bench Press
fr: Développé couché prise serrée avec barre

# crossover-bands
source: Crossover with Bands
fr: Crossover avec bandes

source: Decline Barbell Bench Press
fr: Développé couché décliné avec barre

source: Decline Dumbbell Bench Press
fr: Développé couché décliné avec haltères

source: Decline Dumbbell Flys
fr: Écartés déclinés avec haltères

source: Chest Dips
fr: Dips pour pectoraux

# bench-press-dumbbell
source: Bench Press with Dumbbell
fr: Développé couché avec haltères

source: Dumbbell Flys
fr: Écartés avec haltères

source: Flat Bench Cable Flys
fr: Écartés avec câble à plat sur banc

source: Barbell Front Raise Pullover
fr: Pull-over avec barre et élévation avant

source: Hammer Grip Incline Bench Press
fr: Développé couché incliné prise marteau

source: Incline Cable Flys
fr: Écartés inclinés avec câble

source: Dumbbell Incline Bench Press
fr: Développé couché incliné avec haltères

source: Incline Dumbbell Flys
fr: Écartés inclinés avec haltères

# incline-flys-twist
source: Incline Flys with Twist
fr: Écartés inclinés avec rotation

source: Wide Grip Decline Barbell Pullover
fr: Pull-over décliné en prise large avec barre

source: Machine Bench Press
fr: Développé couché sur machine

source: Barbell Neck Press
fr: Presse nuque avec barre

source: One-arm Bench Press
fr: Développé couché d'un bras avec haltère

source: BOSU Ball Push Up
fr: Pompes sur ballon Bosu

source: One-arm Barbell Floor Press
fr: Développé couché au sol d'un bras avec barre

source: One-arm Flat Bench Flys
fr: Écartés à plat d'un bras avec haltère

source: One-armed Biased Push Up
fr: Pompes inclinées d'un bras

source: Push Ups Close and Wide Hand Versions
fr: Pompes version mains serrées et écartées

source: Push Up Feet Elevated
fr: Pompes pieds surélevés

source: Push Up Feet Elevated 2
fr: Pompes pieds surélevés 2

source: Push Ups with Feet on Exercise Ball
fr: Pompes avec pieds sur un ballon d'exercice

source: Push Ups
fr: Pompes

source: Straight Arm Dumbbell Pullover
fr: Pull-over avec haltères bras tendus

source: Incline Dumbbell Press
fr: Développé incliné avec haltères

source: Smith Machine Incline Bench Press
fr: Presse inclinée sur machine Smith

source: Wide Grip Bench Press
fr: Développé couché prise large

source: Wide Grip Decline Bench Press
fr: Développé couché décliné prise large

source: Incline Chest Press
fr: Presse inclinée pour poitrine

source: Decline Chest Press
fr: Presse déclinée pour poitrine

source: Body Row
fr: Rowing horizontal

source: Pull-ups
fr: Tractions

source: Gironda Sternum Chins
fr: Tractions sternum Gironda

source: Chin-ups
fr: Tractions supination

source: Narrow Parallel Grip Chin-ups
fr: Tractions prise serrée parallèle

source: Wide Grip Chin-up
fr: Tractions prise large

source: Straight Arm Push Down
fr: Push-down bras tendus

source: Underhand Pull-downs
fr: Pull-down en supination

source: Upright Band Rows
fr: Rowing vertical avec bande de résistance

source: Underhand Pull-down
fr: Pull-down en prise supination

source: V-Bar Pull-down
fr: Pull-down avec barre V

source: Wide Grip Lat Pull-down
fr: Pull-down prise large pour dorsaux

source: Pullover Stability Ball Weight
fr: Pull-over sur ballon de stabilité avec poids

source: Smith Machine Dead Lifts
fr: Soulevé de terre sur machine Smith

source: Barbell Dead Lifts
fr: Soulevé de terre avec barre

source: Barbell Good Mornings
fr: Bonjours avec barre

source: Smith Machine Good Mornings
fr: Bonjours sur machine Smith

source: Back Extension Stability Ball
fr: Extension du dos sur ballon de stabilité

source: Dumbbell Dead Lifts
fr: Soulevé de terre avec haltères

source: Bridging
fr: Ponts

source: Body Leg Lifts
fr: Levées de jambes

source: One-legged Cable Kickback
fr: Extension de jambe d'un côté avec câble

source: Side Plank
fr: Planche latérale

source: Barbell Lunges
fr: Fentes avec barre

source: Dumbbell Lunges
fr: Fentes avec haltères

source: Flutter Kicks
fr: Kicks papillon

source: Lying Leg Curl Machine
fr: Flexion des jambes allongé sur machine

source: Romanian Dead Lift
fr: Soulevé de terre roumain

source: Seated Leg Curl
fr: Flexion des jambes assis

source: Standing Leg Curls
fr: Flexion des jambes debout

source: Walking Lunges
fr: Fentes en marchant

source: Barbell Squat
fr: Squat avec barre

source: Hack Squat Machine
fr: Hack squat sur machine

source: Smith Machine Squats
fr: Squats sur machine Smith

source: Hack Squat with Barbell
fr: Hack squat avec barre

source: Smith Machine Hack Squat
fr: Hack squat sur machine Smith

source: Leg Press
fr: Presse à cuisses

source: Rear Lunges with Barbell
fr: Fentes arrière avec barre

source: Rear Lunges with Dumbbell
fr: Fentes arrière avec haltères

source: Squats using Dumbbells
fr: Squats avec haltères

source: Side Squats with Barbell
fr: Squats latéraux avec barre

source: Single Leg Squat with Barbell
fr: Squat d'une jambe avec barre

source: Squat to Bench with Barbell
fr: Squat sur banc avec barre

source: Step-ups with Barbell
fr: Montées sur marche avec barre

source: Hip Adduction
fr: Adduction de hanche

source: Squat to Bench with Dumbbells
fr: Squat sur banc avec haltères

source: Step-ups with Dumbbells
fr: Montées sur marche avec haltères

source: Front Squat with Barbell
fr: Front squat avec barre

source: Front Squat to Bench with Barbells
fr: Front squat sur banc avec barres

source: Iron Cross with Dumbbells
fr: Croix de fer avec haltères

source: Jefferson Squats with Barbell
fr: Squats Jefferson avec barre

source: Leg Extensions
fr: Extensions de jambe

source: Narrow Stance Leg Press
fr: Presse à cuisses en prise serrée

source: Lying Squat
fr: Squat allongé

source: Narrow Stance Squat with Barbell
fr: Squat en prise serrée avec barre

source: One-Leg Squat with Barbell
fr: Squat sur une jambe avec barre

source: One-Arm Snatch with Barbell
fr: Arraché d'un bras avec barre

source: One-Arm Side Deadlift with Barbell
fr: Soulevé latéral d'un bras avec barre

source: Overhead Squat with Barbell
fr: Squat en position haute avec barre

source: Pile Squat with Dumbbell
fr: Squat en pile avec haltère

source: Speed Squats with Barbell
fr: Squat rapide avec barre

source: Squats with Exercise Bands
fr: Squats avec bande de résistance

source: Thigh Abductor
fr: Adducteur de cuisse

source: Thigh Adductor
fr: Abducteur de cuisse

source: Weighted Sissy Squat with Weight Plate
fr: Sissy squat lesté avec plaque de poids

source: Wide Stance Squat with Barbell
fr: Squat en prise large avec barre

source: Zecher Squats
fr: Squats Zecher

source: Bench Dips
fr: Dips sur banc

source: Incline Pushdown with Cable
fr: Extension en poulie inclinée avec câble

source: Incline Triceps Extension with Cable
fr: Extension de triceps inclinée avec câble

source: Lying Triceps Extension with Cable
fr: Extension de triceps allongé avec câble

source: One-Arm Tricep Extension with Cable
fr: Extension de triceps d'un bras avec câble

source: Standing Triceps Extension
fr: Extension de triceps debout

source: Decline Close-Grip Bench to Skull Crusher
fr: Décliné prise serrée de développé couché à écraseur de crâne

source: Decline Triceps Extension with Dumbbell
fr: Extension de triceps déclinée avec haltère

source: Decline EZ Bar Triceps Extension with Barbell
fr: Extension de triceps déclinée avec barre EZ

source: Tricep Dips
fr: Dips pour triceps

source: Tricep Dips using Body Weight
fr: Dips pour triceps avec poids du corps

source: One-Arm Triceps Extension with Dumbbell
fr: Extension de triceps d'un bras avec haltère

source: Incline Triceps Extension with Barbell
fr: Extension de triceps inclinée avec barre

source: JM Press
fr: Press JM

source: Kneeling Triceps Extension with Cable
fr: Extension de triceps à genoux avec câble

source: Kneeling Triceps Extension with Cable 2
fr: Extension de triceps à genoux avec câble 2

source: Low Triceps Extension with Cable
fr: Extension de triceps basse avec câble

source: Lying Close-Grip Triceps Extension Behind the Head with Barbell
fr: Extension de triceps allongé prise serrée derrière la tête avec barre

source: Lying Close-Grip Triceps Press to Chin with Barbell
fr: Presse triceps allongé prise serrée au menton avec barre

source: Lying Triceps Extension with Dumbbells
fr: Extension de triceps allongé avec haltères

source: Lying Triceps Extension Across Face with Dumbbell
fr: Extension de triceps allongé sur le visage avec haltère

source: Lying Triceps Press with Barbell
fr: Presse triceps allongé avec barre

source: Lying Two-Arm Triceps Extension with Dumbbell
fr: Extension de triceps allongé à deux bras avec haltère

source: Old School Reverse Extensions
fr: Extensions inversées à l'ancienne

source: Single-Arm Triceps Extension with Dumbbell
fr: Extension de triceps d'un bras avec haltère

source: Single-Arm Supinated Triceps Extension with Dumbbell
fr: Extension de triceps d'un bras en supination avec haltère

source: Close Triceps Pushup
fr: Pompes serrées pour triceps

source: Reverse Grip Triceps Pushdown
fr: Poulie haute en prise inversée pour triceps

source: Reverse Triceps Bench Press with Barbell
fr: Développé couché pour triceps en prise inversée avec barre

source: Seated One-Arm Triceps Extension with Dumbbell
fr: Extension de triceps assis d'un bras avec haltère

source: Seated Two-Arm Triceps Extension with Dumbbell
fr: Extension de triceps assis à deux bras avec haltère

source: Seated Overhead Triceps Extension with Barbell
fr: Extension de triceps assis au-dessus de la tête avec barre

source: Seated Triceps Press with Dumbbell
fr: Presse triceps assis avec haltère

source: Smith Machine Close-Grip Bench Press
fr: Développé couché prise serrée sur machine Smith

source: Bent-Over One-Arm Triceps Extension with Dumbbell
fr: Extension de triceps à un bras penché en avant avec haltère

source: Bent-Over Two-Arm Triceps Extension with Dumbbell
fr: Extension de triceps à deux bras penché en avant avec haltère

source: Standing Triceps Extension 2
fr: Extension de triceps debout 2

source: One-Arm Low Pulley Triceps Extension with Cable
fr: Extension de triceps à une poulie basse d'un bras avec câble

source: Standing One-Arm Triceps Extension with Dumbbell
fr: Extension de triceps debout à un bras avec haltère

source: Standing Overhead Triceps Extension with Barbell
fr: Extension de triceps debout au-dessus de la tête avec barre

source: Standing Triceps Extension with Towel
fr: Extension de triceps debout avec serviette

source: Tate Press with Dumbbell
fr: Presse Tate avec haltère

source: Triceps Kickback with Dumbbell
fr: Coup de pied triceps avec haltère

source: Triceps Pushdown with Cable
fr: Poussée vers le bas pour triceps avec câble

source: Triceps Pushdown with Rope and Cable
fr: Poussée vers le bas pour triceps avec corde et câble

source: Triceps Pushdown with V-Bar and Cable
fr: Poussée vers le bas pour triceps avec barre en V et câble

source: Weighted Ball Side Bend
fr: Inclinaison latérale lestée avec ballon

source: Incline Triceps Extensions with Dumbbell
fr: Extensions de triceps inclinées avec haltère

source: Triceps Extensions using Machine
fr: Extensions de triceps avec machine

source: Biceps Curls with Barbell
fr: Curls pour biceps avec barre

source: Standing Biceps Curl with Cable
fr: Curl pour biceps debout avec câble

source: Alternating Hammer Curl with Dumbbell
fr: Curl marteau alterné avec haltère

source: Alternating Incline Curl with Dumbbell
fr: Curl incliné alterné avec haltère

source: Lying Incline Curl with Barbell
fr: Curl incliné allongé avec barre

source: Hammer Curls with Rope and Cable
fr: Curls marteau avec corde et câble

source: Preacher Curl with Cable
fr: Curl prédicateur avec câble

source: Close Grip EZ Bar Curl with Barbell
fr: Curl à prise serrée avec barre EZ

source: Close Grip Standing Biceps Curls with Barbell
fr: Curls biceps debout à prise serrée avec barre

source: Concentration Curls with Dumbbell
fr: Curls concentration avec haltère

source: Cross-Body Hammer Curl with Dumbbell
fr: Curl marteau en travers du corps avec haltère

source: Drag Curl with Barbell
fr: Curl à traîner avec barre

source: Alternating Biceps Curl with Dumbbell
fr: Curl biceps alterné avec haltère

source: Biceps Curl with Dumbbell
fr: Curl biceps avec haltère

source: Prone Incline Biceps Curl with Dumbbell
fr: Curl biceps incliné proné avec haltère

source: EZ Bar Curl with Barbell
fr: Curl avec barre EZ

source: Biceps Hammer Curl with Dumbbell
fr: Curl marteau pour biceps avec haltère

source: Flexor Incline Curls with Dumbbell
fr: Curls fléchisseurs inclinés avec haltère

source: High Cable Curls
fr: Curls hauts avec câble

source: Incline Inner Biceps Curl with Dumbbell
fr: Curl biceps interne incliné avec haltère

source: Incline Inner Biceps Curl with Dumbbell 2
fr: Curl biceps interne incliné avec haltère 2

source: Lying Bicep Cable Curl
fr: Curl biceps allongé avec câble

source: Lying Close-Grip Biceps Curls with Cable
fr: Curls biceps allongé prise serrée avec câble

source: Lying High Bench Biceps Curl with Barbell
fr: Curl biceps allongé sur banc haut avec barre

source: Lying Supine Biceps Curl with Dumbbell
fr: Curl biceps allongé en position supine avec haltère

source: Preacher Curl with Machine
fr: Curl prédicateur avec machine

source: One-Arm Preacher Curl with Dumbbell
fr: Curl prédicateur à un bras avec haltère

source: Overhead Curl with Cable
fr: Curl au-dessus de la tête avec câble

source: Preacher Curl with Barbell
fr: Curl prédicateur avec barre

source: Preacher Hammer Curl with Dumbbell
fr: Curl marteau prédicateur avec haltère

source: Reverse Plate Curls with Weight
fr: Curls de plaques inversées avec poids

source: Seated Close-Grip Concentration Curls with Barbell
fr: Curls concentration assis prise serrée avec barre

source: Seated Biceps Curl with Dumbbell
fr: Curl biceps assis avec haltère

source: Seated Inner Biceps Curl with Dumbbell
fr: Curl biceps interne assis avec haltère

source: Spider Curl with Barbell
fr: Curl d'araignée avec barre

source: Standing Inner Biceps Curl with Dumbbell
fr: Curl biceps interne debout avec haltère

source: Standing One-Arm Biceps Curl with Cable
fr: Curl biceps à un bras debout avec câble

source: Standing One-Arm Curl Over Incline Bench with Dumbbell
fr: Curl à un bras debout sur banc incliné avec haltère

source: Two-Arm Preacher Curl with Dumbbell
fr: Curl prédicateur à deux bras avec haltère

source: Wide Grip Standing Biceps Curl with Barbell
fr: Curl biceps debout prise large avec barre

source: Zottman Curl with Dumbbells
fr: Curl Zottman avec haltères

source: Zottman Preacher Curl with Dumbbells
fr: Curl prédicateur Zottman avec haltères

source: Biceps Curl with Machine
fr: Curl biceps avec machine

source: One-Arm Biceps Curl with Olympic Bar or Barbell
fr: Curl biceps à un bras avec barre olympique ou barre

source: Biceps Curl Seated on Stability Ball with Dumbbell
fr: Curl biceps assis sur un ballon de stabilité avec haltère

source: Biceps Curl Squat with Dumbbell
fr: Curl biceps en squat avec haltère

source: Biceps Curl Reverse with Dumbbells
fr: Curl biceps inversé avec haltères

source: One-Arm Bicep Concentration on Stability Ball with Dumbbell
fr: Concentration biceps à un bras sur un ballon de stabilité avec haltère

source: Biceps Curl with Deadlift with Barbell
fr: Curl biceps avec soulevé de terre avec barre

source: Biceps Curl with Overhead Extension Using Dumbbells on Stability Ball
fr: Curl biceps avec extension au-dessus de la tête en utilisant des haltères sur un ballon de stabilité

source: Quick Alternating Biceps Curls with Band
fr: Curls biceps rapides alternés avec bande

source: Biceps Curl Lunge with Bowling Motion
fr: Curl biceps en fente avec mouvement de bowling

source: Biceps Curl on Stability Ball with Leg Raised
fr: Curl biceps sur un ballon de stabilité avec jambe levée

source: Lateral Lunge with Biceps Curl with Dumbbell
fr: Fente latérale avec curl biceps avec haltère

source: Forward Lunge with Biceps Curl Using Dumbbell
fr: Fente avant avec curl biceps en utilisant un haltère

source: Step-Up Single Leg Balance with Biceps Curl Using Dumbbells
fr: Montée avec équilibre sur une jambe avec curl biceps en utilisant des haltères

source: Medicine Ball Biceps Curl on Stability Ball
fr: Curl biceps avec un ballon médical sur un ballon de stabilité

source: Stork Stance Biceps Curl with Dumbbells
fr: Curl biceps en position de cigogne avec haltères

source: Biceps Curl V-Sit on Dome with Dumbbells
fr: Curl biceps en V-sit sur un dôme avec haltères

source: Ankle Circles
fr: Cercles de cheville

source: Balance Board
fr: Planche d'équilibre

source: Seated Calf Raise with Barbell
fr: Élévation des mollets assis avec barre

source: Calves Press on Leg Machine
fr: Presse mollets sur machine à jambes

source: Calf Raises with Band
fr: Élévations de mollets avec bande

source: Donkey Calf Raises
fr: Élévations de mollets à l'âne

source: Seated One-Leg Calf Raise with Dumbbell
fr: Élévation d'un mollet assis avec haltère

source: Knee Circles
fr: Cercles de genoux

source: Rocking Standing Calf Raise with Barbell
fr: Élévation de mollets debout en balançant avec barre

source: Seated Calf Raise Using Machine
fr: Élévation des mollets assis avec machine

source: Smith Machine Reverse Calf Raises
fr: Élévations de mollets inversées avec machine Smith

source: Standing Barbell Calf Raise
fr: Élévation de mollets debout avec barre

source: Standing Calf Raises Using Machine
fr: Élévations de mollets debout avec machine

source: Standing Calf Raise with Dumbbell
fr: Élévation de mollets debout avec haltère

source: Air Bike
fr: Vélo aérien

source: Ab Rollout with Barbell
fr: Déroulement abdominal avec barre

source: Ab Rollout on Knees with Barbell
fr: Déroulement abdominal à genoux avec barre

source: Bent Knee Hip Raise
fr: Élévation des hanches à genoux

source: Seated Ab Crunch with Cable
fr: Crunch abdominal assis avec câble

source: Cross-Body Crunch
fr: Crunch croisé

source: Crunches with Legs on Stability Ball
fr: Crunch avec les jambes sur un ballon de stabilité

source: Crunches
fr: Crunch

source: Decline Crunch
fr: Crunch décliné

source: Decline Oblique Crunch
fr: Crunch oblique décliné

source: Side Bend with Dumbbell
fr: Inclinaison latérale avec haltère

source: Stability Ball Abdominal Crunch
fr: Crunch abdominal sur un ballon de stabilité

source: Exercise Ball Pull-In
fr: Traction sur un ballon d'exercice

source: Bent Over Row with Barbell
fr: Rowing penché avec barre
